## Pandas

### Instructions

This assignment will be done completely inside this Jupyter notebook with answers placed in the cell provided.

All python imports that are needed shown.

Follow all the instructions in this notebook to complete these tasks.    

Make sure the CSV data files is in the same folder as this notebook - alumni.csv

In [1]:
# Imports needed to complete this exam

import pandas as pd
import matplotlib.pyplot as plt

### Question 1 :  Import CSV file (1 Mark)


Write code to load the alumni csv dataset into a Pandas DataFrame called 'alumni'.

In [3]:
#q1 (1)
alumni = pd.read_csv('alumni.csv')
alumni

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"
...,...,...,...,...,...,...,...,...
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

### Question 2 :  Understand the data set (5 Marks)

Use the following pandas commands to understand the data set: a) head, b) tail, c) dtypes, d) info, e) describe

In [347]:
#a) (1)

In [348]:
#b) (1)

In [349]:
#c) (1)

In [350]:
#d) (1)

In [351]:
#e) (1)

### Question 3 :  Cleaning the data set - part A (3 Marks)

a) Use clean_currency method below to strip out commas and dollar signs from Savings ($) column and put into a new column called 'Savings'.

In [352]:
def clean_currency(curr):
    return float(curr.replace(",", "").replace("$", ""))

clean_currency("$66,000")

66000.0

In [353]:
#a) (2)

b) Uncomment 'alumni.dtypes.Savings' to check that the type change has occurred

In [354]:
#b) (1)
#alumni.dtypes.Savings

### Question 4 :  Cleaning the data set - part B (5 Marks)

a) Run the 'alumni["Gender"].value_counts()' to see the incorrect 'M' fields that need to be converted to 'Male'

In [355]:
# a) (1)

b) Now use a '.str.replace' on the 'Gender' column to covert the incorrect 'M' fields. Hint: We must use ^...$ to restrict the pattern to match the whole string.

In [356]:
# b) (1)

c) That didn't the set alumni["Gender"] column however. You will need to update the column when using the replace command 'alumni["Gender"]=<replace command>', show how this is done below

In [357]:
# c) (1)
#alumni["Gender"]=

d) You can set it directly by using the df.loc command, show how this can be done by using the 'df.loc[row_indexer,col_indexer] = value' command to convert the 'M' to 'Male'

In [358]:
# d) (1)

e) Now run the 'value_counts' for Gender again to see the correct columns - 'Male' and 'Female'

In [359]:
# e) (1)

### Question 5 :  Working with the data set (4)

a) get the median, b) mean and c) standard deviation for the 'Salary' column

In [360]:
# a)(1)

In [361]:
# b)(1)

In [362]:
# c)(1)

d) identify which alumni paid more than $15000 in fees, using the 'Fee' column

In [363]:
# d) (1)

### Question 6 :  Visualise the data set (4 Marks)

a) Using the 'Diploma Type' column, plot a bar chart and show its value counts.

In [364]:
#a) (1)

b) Now create a box plot comparison between 'Savings' and 'Salary' columns

In [365]:
#b) (1)
savings_salary = ["Savings", "Salary"]

c) Generate a histogram with the 'Salary' column and use 12 bins.

In [366]:
#c) (1)

d) Generate a scatter plot comparing 'Salary' and 'Savings' columns.

In [367]:
#d) (1)

### Question 7 :  Contingency Table (2 Marks)

Using both the 'Martial Status' and 'Defaulted' create a contingency table. Hint: crosstab

In [368]:
# Q7 (2)